tap "minio/stable"
tap "productdevbook/tap"
brew "antidote"
brew "jpeg-xl"
brew "aom"
brew "git"
brew "asdf"
brew "ast-grep"
brew "bat"
brew "broot"
brew "glib"
brew "chamber"
brew "chezmoi"
brew "coreutils"
brew "ctags"
brew "curl"
brew "docker-compose"
brew "docker-credential-helper"
brew "unbound"
brew "gnutls"
brew "emacs", restart_service: :changed
brew "erdtree"
brew "eza"
brew "fd"
brew "harfbuzz"
brew "icu4c@77"
brew "pango"
brew "ffmpeg"
brew "fish"
brew "fzf"
brew "gcc"
brew "gh"
brew "ghi"
brew "glow"
brew "librsvg"
brew "graphviz"
brew "hub"
brew "jq"
brew "lazygit"
brew "luarocks"
brew "readline"
brew "macvim"
brew "mosh"
brew "neovim"
brew "nushell"
brew "ossp-uuid"
brew "pgcli"
brew "pgvector"
brew "phrase-cli"
brew "postgresql@17", restart_service: :changed
brew "python@3.11"
brew "ranger"
brew "rclone"
brew "reattach-to-user-namespace"
brew "ripgrep"
brew "starship"
brew "telnet"
brew "the_silver_searcher"
brew "tree-sitter-cli"
brew "volta"
brew "zellij"
brew "zlib"
brew "zoxide"
brew "zsh"
brew "minio/stable/mc"
brew "minio/stable/minio"
cask "1password"
cask "1password-cli"
cask "anki"
cask "aws-vault-binary"
cask "balenaetcher"
cask "brave-browser"
cask "chatgpt"
cask "claude"
cask "cleanmymac"
cask "cursor"
cask "dbeaver-community"
cask "displaylink"
cask "docker-desktop"
cask "emacsclient"
cask "firefox"
cask "font-hack-nerd-font"
cask "ghostty"
cask "github"
cask "google-chrome"
cask "google-chrome@canary"
cask "google-drive"
cask "hammerspoon"
cask "homerow"
cask "imageoptim"
cask "insomnia"
cask "jordanbaird-ice"
cask "jump-desktop-connect"
cask "keeweb"
cask "linearmouse"
cask "logi-options+"
cask "lulu"
cask "notion"
cask "obsidian"
cask "only-switch"
cask "onyx"
cask "pdf-expert"
cask "pearcleaner"
cask "productdevbook/tap/portkiller"
cask "qlmarkdown"
cask "quicklook-json"
cask "raycast"
cask "rectangle"
cask "signal"
cask "slack"
cask "spotify"
cask "superhuman"
cask "syntax-highlight"
cask "tailscale-app"
cask "telegram"
cask "temurin"
cask "ticktick"
cask "topnotch"
cask "typora"
cask "visual-studio-code"
cask "warp"
cask "wave"
cask "zed"
vscode "aaron-bond.better-comments"
vscode "arcanis.vscode-zipfs"
vscode "asvetliakov.vscode-neovim"
vscode "auiworks.amvim"
vscode "breaking-brake.cc-wf-studio"
vscode "bung87.vscode-gemfile"
vscode "christian-kohler.npm-intellisense"
vscode "christian-kohler.path-intellisense"
vscode "dbaeumer.vscode-eslint"
vscode "donjayamanne.githistory"
vscode "eamodio.gitlens"
vscode "editorconfig.editorconfig"
vscode "esbenp.prettier-vscode"
vscode "felipecaputo.git-project-manager"
vscode "firsttris.vscode-jest-runner"
vscode "github.codespaces"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "github.vscode-github-actions"
vscode "github.vscode-pull-request-github"
vscode "graphql.vscode-graphql"
vscode "graphql.vscode-graphql-syntax"
vscode "gruntfuggly.todo-tree"
vscode "jebbs.plantuml"
vscode "mikestead.dotenv"
vscode "ms-azuretools.vscode-containers"
vscode "ms-ceintl.vscode-language-pack-ko"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-python.vscode-python-envs"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode.makefile-tools"
vscode "ms-vsliveshare.vsliveshare"
vscode "oderwat.indent-rainbow"
vscode "raathigeshan.fabulous"
vscode "redhat.vscode-commons"
vscode "redhat.vscode-yaml"
vscode "robertoachar.vscode-essentials-snippets"
vscode "ryanolsonx.solarized"
vscode "sirtori.indenticator"
vscode "steoates.autoimport"
vscode "streetsidesoftware.code-spell-checker"
vscode "unifiedjs.vscode-mdx"
vscode "vincent-ledu.adr-tools"
vscode "vscode-icons-team.vscode-icons"
vscode "wayou.vscode-todo-highlight"
vscode "zignd.html-css-class-completion"
